results/artillery_load.yml
# Artillery Load Test Configuration
# Target: https://jsonplaceholder.typicode.com/posts
# Generated by api_performance_tester.py

config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 60
      arrivalRate: 5
      name: "Load Test"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Fetch Posts"
    flow:
      - loop:
          - get:
              url: "/posts/{{ $randomInt(1, 100) }}"
              capture:
                - json: "$.id"
                  as: "postId"
        count: 5