results/artillery_spike.yml
# Artillery Spike Test Configuration
# Target: https://jsonplaceholder.typicode.com/posts
# Generated by api_performance_tester.py

config:
  target: "https://jsonplaceholder.typicode.com"
  phases:
    - duration: 10
      arrivalRate: 2
      name: "Baseline"
    - duration: 5
      arrivalRate: 100
      name: "Spike"
    - duration: 10
      arrivalRate: 2
      name: "Recovery"

  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Fetch Posts"
    flow:
      - loop:
          - get:
              url: "/posts/{{ $randomInt(1, 100) }}"
              capture:
                - json: "$.id"
                  as: "postId"
        count: 5